Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C123/TM4C1233E6PM.svd
        <register>
          <name>SRDMA</name>
          <description>Micro Direct Memory Access Software Reset</description>
          <addressOffset>0x0000050C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRDMA_R0</name>
              <description>uDMA Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRHIB</name>
          <description>Hibernation Software Reset</description>
          <addressOffset>0x00000514</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRHIB_R0</name>
              <description>Hibernation Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Software Reset</description>
          <addressOffset>0x00000518</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRUART_R0</name>
              <description>UART Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R1</name>
              <description>UART Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R2</name>
              <description>UART Module 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R3</name>
              <description>UART Module 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R4</name>
              <description>UART Module 4 Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R5</name>
              <description>UART Module 5 Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R6</name>
              <description>UART Module 6 Software Reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R7</name>
              <description>UART Module 7 Software Reset</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSSI</name>
          <description>Synchronous Serial Interface Software Reset</description>
          <addressOffset>0x0000051C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRSSI_R0</name>
              <description>SSI Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R1</name>
              <description>SSI Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R2</name>
              <description>SSI Module 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R3</name>
              <description>SSI Module 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRI2C</name>
          <description>Inter-Integrated Circuit Software Reset</description>
          <addressOffset>0x00000520</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRI2C_R0</name>
              <description>I2C Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R1</name>
              <description>I2C Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R2</name>
              <description>I2C Module 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R3</name>
              <description>I2C Module 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRUSB</name>
          <description>Universal Serial Bus Software Reset</description>
          <addressOffset>0x00000528</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRUSB_R0</name>
              <description>USB Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCAN</name>
          <description>Controller Area Network Software Reset</description>
          <addressOffset>0x00000534</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCAN_R0</name>
              <description>CAN Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRADC</name>
          <description>Analog-to-Digital Converter Software Reset</description>
          <addressOffset>0x00000538</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRADC_R0</name>
              <description>ADC Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRADC_R1</name>
              <description>ADC Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRACMP</name>
          <description>Analog Comparator Software Reset</description>
          <addressOffset>0x0000053C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRACMP_R0</name>
              <description>Analog Comparator Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SREEPROM</name>
          <description>EEPROM Software Reset</description>
          <addressOffset>0x00000558</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SREEPROM_R0</name>
              <description>EEPROM Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRWTIMER</name>
          <description>32/64-Bit Wide General-Purpose Timer Software Reset</description>
          <addressOffset>0x0000055C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRWTIMER_R0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCWD</name>
          <description>Watchdog Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x00000600</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCWD_R0</name>
              <description>Watchdog Timer 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWD_R1</name>
              <description>Watchdog Timer 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCTIMER</name>
          <description>16/32-Bit General-Purpose Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x00000604</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCTIMER_R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Run Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Run Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCGPIO</name>
          <description>General-Purpose Input/Output Run Mode Clock Gating Control</description>
          <addressOffset>0x00000608</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCGPIO_R0</name>
              <description>GPIO Port A Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCGPIO_R1</name>
              <description>GPIO Port B Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCGPIO_R2</name>
              <description>GPIO Port C Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCGPIO_R3</name>
              <description>GPIO Port D Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCGPIO_R4</name>
              <description>GPIO Port E Run Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCGPIO_R5</name>
              <description>GPIO Port F Run Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCDMA</name>
          <description>Micro Direct Memory Access Run Mode Clock Gating Control</description>
          <addressOffset>0x0000060C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCDMA_R0</name>
              <description>uDMA Module Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCHIB</name>
          <description>Hibernation Run Mode Clock Gating Control</description>
          <addressOffset>0x00000614</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCHIB_R0</name>
              <description>Hibernation Module Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Run Mode Clock Gating Control</description>
          <addressOffset>0x00000618</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCUART_R0</name>
              <description>UART Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCUART_R1</name>
              <description>UART Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCUART_R2</name>
              <description>UART Module 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCUART_R3</name>
              <description>UART Module 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCUART_R4</name>
              <description>UART Module 4 Run Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCUART_R5</name>
              <description>UART Module 5 Run Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCUART_R6</name>
              <description>UART Module 6 Run Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCUART_R7</name>
              <description>UART Module 7 Run Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCSSI</name>
          <description>Synchronous Serial Interface Run Mode Clock Gating Control</description>
          <addressOffset>0x0000061C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCSSI_R0</name>
              <description>SSI Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCSSI_R1</name>
              <description>SSI Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCSSI_R2</name>
              <description>SSI Module 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCSSI_R3</name>
              <description>SSI Module 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCI2C</name>
          <description>Inter-Integrated Circuit Run Mode Clock Gating Control</description>
          <addressOffset>0x00000620</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCI2C_R0</name>
              <description>I2C Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCI2C_R1</name>
              <description>I2C Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCI2C_R2</name>
              <description>I2C Module 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCI2C_R3</name>
              <description>I2C Module 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCUSB</name>
          <description>Universal Serial Bus Run Mode Clock Gating Control</description>
          <addressOffset>0x00000628</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCUSB_R0</name>
              <description>USB Module Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCCAN</name>
          <description>Controller Area Network Run Mode Clock Gating Control</description>
          <addressOffset>0x00000634</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCCAN_R0</name>
              <description>CAN Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCADC</name>
          <description>Analog-to-Digital Converter Run Mode Clock Gating Control</description>
          <addressOffset>0x00000638</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCADC_R0</name>
              <description>ADC Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCADC_R1</name>
              <description>ADC Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCACMP</name>
          <description>Analog Comparator Run Mode Clock Gating Control</description>
          <addressOffset>0x0000063C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCACMP_R0</name>
              <description>Analog Comparator Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCEEPROM</name>
          <description>EEPROM Run Mode Clock Gating Control</description>
          <addressOffset>0x00000658</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCEEPROM_R0</name>
              <description>EEPROM Module Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCWTIMER</name>
          <description>32/64-Bit Wide General-Purpose Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x0000065C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCWTIMER_R0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Run Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Run Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCWD</name>
          <description>Watchdog Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000700</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCWD_S0</name>
              <description>Watchdog Timer 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWD_S1</name>
              <description>Watchdog Timer 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
